experiments/results/logs/trace_replay-hybrid-006/wrk2.txt
Running 30m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 4991.014ms, rate sampling interval: 13590ms
  Thread calibration: mean lat.: 4993.899ms, rate sampling interval: 13369ms
  Thread calibration: mean lat.: 4909.581ms, rate sampling interval: 13459ms
  Thread calibration: mean lat.: 4924.788ms, rate sampling interval: 13287ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.23m     4.49m   17.16m    59.29%
    Req/Sec    10.74      8.84    69.00     94.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.06m 
 75.000%   11.80m 
 90.000%   14.89m 
 99.000%   16.44m 
 99.900%   16.89m 
 99.990%   17.11m 
 99.999%   17.16m 
100.000%   17.17m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7184.383     0.000000            1         1.00
  122028.031     0.100000         8067         1.11
  242089.983     0.200000        16128         1.25
  378011.647     0.300000        24238         1.43
  396361.727     0.400000        32306         1.67
  423362.559     0.500000        40324         2.00
  483131.391     0.550000        44347         2.22
  543162.367     0.600000        48400         2.50
  592969.727     0.650000        52424         2.86
  645922.815     0.700000        56453         3.33
  707788.799     0.750000        60478         4.00
  757071.871     0.775000        62480         4.44
  791150.591     0.800000        64518         5.00
  818413.567     0.825000        66530         5.71
  845152.255     0.850000        68556         6.67
  869793.791     0.875000        70568         8.00
  881328.127     0.887500        71563         8.89
  893386.751     0.900000        72592        10.00
  904921.087     0.912500        73594        11.43
  916979.711     0.925000        74589        13.33
  929038.335     0.937500        75590        16.00
  935329.791     0.943750        76121        17.78
  941096.959     0.950000        76607        20.00
  946864.127     0.956250        77097        22.86
  953155.583     0.962500        77634        26.67
  959447.039     0.968750        78119        32.00
  962592.767     0.971875        78355        35.56
  966262.783     0.975000        78625        40.00
  969932.799     0.978125        78872        45.71
  973602.815     0.981250        79122        53.33
  977797.119     0.984375        79365        64.00
  980418.559     0.985938        79511        71.11
  982515.711     0.987500        79629        80.00
  984612.863     0.989062        79743        91.43
  987234.303     0.990625        79871       106.67
  990380.031     0.992188        79999       128.00
  991952.895     0.992969        80059       142.22
  993525.759     0.993750        80119       160.00
  995622.911     0.994531        80185       182.86
  997720.063     0.995313        80240       213.33
 1000865.791     0.996094        80313       256.00
 1001914.367     0.996484        80340       284.44
 1002962.943     0.996875        80366       320.00
 1004535.807     0.997266        80397       365.71
 1006632.959     0.997656        80436       426.67
 1008205.823     0.998047        80462       512.00
 1009254.399     0.998242        80481       568.89
 1009778.687     0.998437        80494       640.00
 1010827.263     0.998633        80506       731.43
 1012400.127     0.998828        80523       853.33
 1013448.703     0.999023        80540      1024.00
 1014497.279     0.999121        80547      1137.78
 1015545.855     0.999219        80555      1280.00
 1016594.431     0.999316        80562      1462.86
 1017643.007     0.999414        80570      1706.67
 1018691.583     0.999512        80580      2048.00
 1019215.871     0.999561        80585      2275.56
 1019215.871     0.999609        80585      2560.00
 1020264.447     0.999658        80591      2925.71
 1020788.735     0.999707        80593      3413.33
 1022361.599     0.999756        80598      4096.00
 1022885.887     0.999780        80601      4551.11
 1022885.887     0.999805        80601      5120.00
 1024458.751     0.999829        80604      5851.43
 1024983.039     0.999854        80605      6826.67
 1026555.903     0.999878        80608      8192.00
 1026555.903     0.999890        80608      9102.22
 1027080.191     0.999902        80609     10240.00
 1027604.479     0.999915        80611     11702.86
 1027604.479     0.999927        80611     13653.33
 1028128.767     0.999939        80613     16384.00
 1028128.767     0.999945        80613     18204.44
 1028128.767     0.999951        80613     20480.00
 1028128.767     0.999957        80613     23405.71
 1028653.055     0.999963        80614     27306.67
 1028653.055     0.999969        80614     32768.00
 1028653.055     0.999973        80614     36408.89
 1029701.631     0.999976        80615     40960.00
 1029701.631     0.999979        80615     46811.43
 1029701.631     0.999982        80615     54613.33
 1029701.631     0.999985        80615     65536.00
 1029701.631     0.999986        80615     72817.78
 1030225.919     0.999988        80616     81920.00
 1030225.919     1.000000        80616          inf
#[Mean    =   493645.795, StdDeviation   =   269122.554]
#[Max     =  1029701.632, Total count    =        80616]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  80931 requests in 30.00m, 740.40MB read
  Socket errors: connect 0, read 0, write 0, timeout 23832
  Non-2xx or 3xx responses: 17370
Requests/sec:     44.96
Transfer/sec:    421.19KB